Revit.Elements.FailureMessage
Performance Adviser Failure Message

Revit.Elements.FailureMessage.Description
The description of the message.

Revit.Elements.FailureMessage.FailingElements
The Failing Elements of the message.

Revit.Elements.FailureMessage.Severity
Get the failure severity.